Autodesk.Revit.DB.InstanceVoidCutUtils.GetCuttingVoidInstances(Autodesk.Revit.DB.Element)
Return ids of the instances with unattached voids cutting the element.
element:
The element being cut
Returns:
Ids of instances with unattached voids that cut this element
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.InstanceVoidCutUtils.GetElementsBeingCut(Autodesk.Revit.DB.Element)
Return ids of the elements being cut by the instance
cuttingInstance:
The cutting family instance
Returns:
Ids of elements being cut by cuttingInstance
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.InstanceVoidCutUtils.InstanceVoidCutExists(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element)
Check whether the instance is cutting the element
element:
The element being cut
cuttingInstance:
The cutting family instance
Returns:
Returns true if the instance is cutting the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.InstanceVoidCutUtils.RemoveInstanceVoidCut(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element)
Remove a cut applied to the element by a cutting instance with unattached voids.
document:
The document containing the two elements
element:
The element being cut
cuttingInstance:
The cutting family instance
Throws Autodesk.Revit.Exceptions.ArgumentException:
No instance void cut exists between the two elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to remove the instance cut from the element
Since:
2011

Autodesk.Revit.DB.InstanceVoidCutUtils.AddInstanceVoidCut(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element)
Add a cut to an element using the unattached voids inside a cutting instance.
document:
The document containing the two elements
element:
The element to be cut
cuttingInstance:
The cutting family instance
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element cannot be cut with a void instance.
-or-
The element is not a family instance with an unattached void that can cut.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to cut element with the instances
Since:
2011

Autodesk.Revit.DB.InstanceVoidCutUtils.IsVoidInstanceCuttingElement(Autodesk.Revit.DB.Element)
Indicates if the element is a family instance with unattached voids that can cut other elements.
Remarks:
A family instance can cut if the family has unattached voids and the family's parameter
"Cut with Voids When Loaded" is checked.
element:
The cutting family instance
Returns:
Returns true if the element is a family instance with unattached voids that can cut other elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.InstanceVoidCutUtils.CanBeCutWithVoid(Autodesk.Revit.DB.Element)
Indicates if the element can be cut by an instance with unattached voids.
Remarks:
Elements in a project can be cut if they are host elements or family instances
with a category Generic Model or one of the structural categories.
element:
The element to be cut
Returns:
Returns true if the element can be cut by an instance with unattached voids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.InstanceVoidCutUtils
Utilities for cutting elements by unattached voids in family instances.
Since:
2011